Revit 2026 API

# FormAddProfile Method

---

Add a profile into the form, by a specified edge/param.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int AddProfile(
	Reference edgeReference,
	double param
)
```
```vb
Public Function AddProfile (
	edgeReference As Reference,
	param As Double
) As Integer
```
```cpp
public:
int AddProfile(
	Reference^ edgeReference,
	double param
)
```
```fsharp
member AddProfile :
        edgeReference : Reference *
        param : float -> int
```

#### Parameters

edgeReference Reference
    The geometry reference of edge.
param Double
    The param on edge to specify the location.

#### Return Value

Int32Index of newly created profile.

#### Reference

Form Class

Autodesk.Revit.DB Namespace